In [2]:
# python to Mysql connect

In [1]:
import pymysql as py
print('Done')

Done

pip install PyMySQL

In [3]:
import pymysql as p
print('Done')

Done

In [4]:
conn = p.connect(user = 'root',
           password='simmi.935012',
           host= 'localhost',
           autocommit= True)

print('Connection Created Successfully!!')

Connection Created Successfully!!

In [5]:
cur = conn.cursor()
print('Done')

Done

In [1]:
# create database using python

In [6]:
query = '''create database IINTM_DAY5;'''

cur.execute(query)
print('Done')

Done

In [7]:
query = 'USE IINTM_DAY5;'
cur.execute(query)
print('Done')

Done

In [8]:
query = '''create table student_details
(
SID int not null,
student_name varchar(50),
course varchar(50),
Address varchar(50),
Scholarship float
);'''

cur.execute(query)
print('Done')

Done

In [9]:
query = '''insert into student_details 
values
(101,"Simran","BCA","Delhi Janakpuri",5000),
(102,"Harsh","MCA","Delhi Janakpuri",5500);
'''
cur.execute(query)
print('Done')

Done

In [13]:
n=3
for i in range(n):
    sid = int(input('Enter Roll No/SID:'))
    name = input('Enter your Name:')
    course = input('Enter your Course:')
    address = input('Enter your Address:')
    scholarship = int(input('Enter your Scholarship in RS: :'))
    
    q=f'''insert into student_details value
    
    ({sid},"{name}","{course}","{address}",{scholarship});'''
    
    cur.execute(q)
    print('Record Inserted Successfully!!')
print('Done')

Enter Roll No/SID: 103
Enter your Name: Dhruv
Enter your Course: BCA
Enter your Address: Mumabi
Enter your Scholarship in RS: : 15000

Record Inserted Successfully!!

Enter Roll No/SID: 104
Enter your Name: Aman
Enter your Course: B.Tech
Enter your Address: Pune
Enter your Scholarship in RS: : 55000

Record Inserted Successfully!!

Enter Roll No/SID: 106
Enter your Name: Shalu
Enter your Course: BBA
Enter your Address: Delhi
Enter your Scholarship in RS: : 45000

Record Inserted Successfully!!
Done

In [21]:
query='''select * from student_details;'''
cur.execute(query)

records = cur.fetchall()

all_columns = []
for i in cur.description:
    all_columns.append(i[0])


import pandas as pd
pd.DataFrame(records,columns=all_columns)

   SID student_name  course          Address  Scholarship
0  101       Simran     BCA  Delhi Janakpuri       5000.0
1  102        Harsh     MCA  Delhi Janakpuri       5500.0
2  105       kunika     MCA    Greater Noida      55000.0
3  103         Aman     BCA           Mumbai      15000.0
4  104        Shalu     BBA             Pune      20000.0
5  103        Dhruv     BCA           Mumabi      15000.0
6  104         Aman  B.Tech             Pune      55000.0
7  106        Shalu     BBA            Delhi      45000.0

In [19]:
all_columns = []
for i in cur.description:
    all_columns.append(i[0])
print(all_columns)

['SID', 'student_name', 'course', 'Address', 'Scholarship']

In [23]:
def show_records(db,table):
    
    query=f'''select * from {db}.{table};'''
    cur.execute(query)
    
    records = cur.fetchall()
    
    all_columns = []
    for i in cur.description:
        all_columns.append(i[0])
    
    
    import pandas as pd
    df = pd.DataFrame(records,columns=all_columns)
    return df

In [27]:
show_records('iintm_day5','student_details')

   SID student_name  course          Address  Scholarship
0  101       Simran     BCA  Delhi Janakpuri       5000.0
1  102        Harsh     MCA  Delhi Janakpuri       5500.0
2  105       kunika     MCA    Greater Noida      55000.0
3  103         Aman     BCA           Mumbai      15000.0
4  104        Shalu     BBA             Pune      20000.0
5  103        Dhruv     BCA           Mumabi      15000.0
6  104         Aman  B.Tech             Pune      55000.0
7  106        Shalu     BBA            Delhi      45000.0